scottyanke/PVCC2-AHU/AHU_1.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "RS485_En_aliases.h"
#include "RS485_En.h"
#include "Rx_Int.h"
#include "relay_aliases.h"
#include "relay.h"
#include "MOSI0_aliases.h"
#include "MOSI0.h"
#include "MAX31865_CS_aliases.h"
#include "MAX31865_CS.h"
#include "SCLK0_aliases.h"
#include "SCLK0.h"
#include "Timer_Int.h"
#include "Timer.h"
#include "MISO0_aliases.h"
#include "MISO0.h"
#include "LED_aliases.h"
#include "LED.h"
#include "Wemos_Rx_Int.h"
#include "A1_aliases.h"
#include "A1.h"
#include "ADC.h"
#include "A2_aliases.h"
#include "A2.h"
#include "AMux.h"
#include "Wire1_aliases.h"
#include "Wire1.h"
#include "DINP_aliases.h"
#include "DINP.h"
#include "Wemos.h"
#include "RS485.h"
#include "DIP_aliases.h"
#include "DIP.h"
#include "Rx_Timer.h"
#include "Rx_Timer_Int.h"
#include "SPIM.h"
#include "SPIM_PVT.h"
#include "A0_aliases.h"
#include "A0.h"
#include "A3_aliases.h"
#include "A3.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "Wemos_IntClock.h"
#include "RS485_IntClock.h"
#include "SPIM_IntClock.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

